[
    {
        "id" : 0,
        "text" : "I have never played tennis before.",
        "rating" : "1.0-1.5",
        "endIfSelected" : true,
        "type" : "general"
    },

    {
        "id" : 1,
        "text" : "I have been very briefly introduced to the game, but I have extreme difficulty playing the game due to a lack of consistency in rallying and serving.",
        "rating" : "1.5-2.0",
        "endIfSelected" : true,
        "type" : "general"
    }, 

    {
        "id" : 2,
        "text" : "I lack control on my groundstrokes, resulting in inconsistent rallies. I often chooses to hit forehands instead of backhands.",
        "rating" : "2.0",
        "endIfSelected" : false,
        "type" : "groundstrokes"
    }, 

    {
        "id" : 3,
        "text" : "I can rally 10 balls in a row, especially on the forehand, with an arched trajectory over the net when the objective is to hit to a partner at moderate speed.",
        "rating" : "2.5",
        "endIfSelected" : false,
        "type" : "groundstrokes"
    }, 

    {
        "id" : 4,
        "text" : "I am able to consistently rally 10 balls in a row on forehands and backhands at a moderate to faster pace. I am able to maintain a rally when receiving high, short, or wide balls with some success.",
        "rating" : "3.0",
        "endIfSelected" : false,
        "type" : "groundstrokes"
    },

    {
        "id" : 5,
        "text" : "I am able to move the opponent around the court or hit harder when receiving easier balls. I can execute approach shots with some consistency.",
        "rating" : "3.5",
        "endIfSelected" : false,
        "type" : "groundstrokes"
    },

    {
        "id" : 6,
        "text" : "I am able to develop points with consistency by using a reliable combination of shots. I am erratic when attempting a quality shot, when receiving fast or wide balls, or when attempting passing shots.",
        "rating" : "4.0",
        "endIfSelected" : false,
        "type" : "groundstrokes"
    },

    {
        "id" : 7,
        "text" : "I can use a variety of spins. I am beginning to develop a dominant shot and/or good steadiness. I am a bit erratic when attempting a quality shot in two of the following situations: when receiving fast balls, wide balls, and in passing shot situations.",
        "rating" : "4.5",
        "endIfSelected" : false,
        "type" : "groundstrokes"
    },

    {
        "id" : 8,
        "text" : "I am able to maintain a rally of 10 balls in a row on fast balls. I have very steady strokes and/or a dominant shot. I periodically succeed when attempting a quality shot when receiving fast or wide balls, and in passing shot situations.",
        "rating" : "5.0",
        "endIfSelected" : false,
        "type" : "groundstrokes"
    },
    
    {

        "id" : 9,
        "text" : "I have an inconsistent return. I tend to position myself in a manner to protect weaknesses.",
        "rating" : "2.0",
        "endIfSelected" : false,
        "type" : "Return of Serve"
    },

    {
        "id" : 10,
        "text" : "I am somewhat consistent when returning towards the middle of the court.",
        "rating" : "2.5",
        "endIfSelected" : false,
        "type" : "Return of Serve"
    },

    {
        "id" : 11,
        "text" : "I can control the direction of the ball when receiving a serve of moderate pace.",
        "rating" : "3.0",
        "endIfSelected" : false,
        "type" : "Return of Serve"
    },

    {
        "id" : 12,
        "text" : "I can return fast serves or well placed serves with defensive actions. When receiving an easy second serve, I can return with pace or directional control.",
        "rating" : "3.5",
        "endIfSelected" : false,
        "type" : "Return of Serve"
    },

    {
        "id" : 13,
        "text" : "I only have difficulty in returning spin serves or when receiving very fast serves. On moderately paced serves, I can construct the point through hitting a good shot or exploiting an opponent's weakness. I occasionally struggle to return second serves.",
        "rating" : "4.0",
        "endIfSelected" : false,
        "type" : "Return of Serve"
    },

    {
        "id" : 14,
        "text" : "When recieving fast first serves, I can defend serves consistently but I am very inconsistent when attempting an aggressive return. I am very consitent returning second serves.",
        "rating" : "4.5",
        "endIfSelected" : false,
        "type" : "Return of Serve"
    },

    {
        "id" : 15,
        "text" : "I periodically succeed at sending an aggressive return off fast first serves using my dominant shot (forehand or backhand). I almost never miss returning a second serve, and I am often able to attack it and win the point.",
        "rating" : "5.0",
        "endIfSelected" : false,
        "type" : "Return of Serve"
    },

    {
        "id" : 16,
        "text" : "I am reluctant to come to the net. I avoid my backhand volley and am a bit lost at times as to what to do with the forehand volley.",
        "rating" : "2.0",
        "endIfSelected" : false,
        "type" : "Net Play"
    },

    {
        "id" : 17,
        "text" : "I have become at ease at the net in practice for the most part but I am still uncomfortable in most game situations. I am usually able to put away easy forehand volleys at chest-to-shoulder height into a wide open court.",
        "rating" : "2.5",
        "endIfSelected" : false,
        "type" : "Net Play"
    },

    {
        "id" : 18,
        "text" : "I am very consistent on the forehand volley with easy and sometimes medium difficulty balls, but I am still inconsistent on the backhand volley. Overall, I have difficulty with low and wide balls. I can smash easy lobs.",
        "rating" : "3.0",
        "endIfSelected" : false,
        "type" : "Net Play"
    },

    {
        "id" : 19,
        "text" : "I have become confident at the net. I can direct forehand volleys; I can control the backhand volley but with little offense; I still have some difficulty with making tactically sound volley decisions. I can handle volleys and overheads that require moderate movement.",
        "rating" : "3.5",
        "endIfSelected" : false,
        "type" : "Net Play"
    },

    {
        "id" : 20,
        "text" : "I am comfortable with following an approach shot to the net and volleying into tactically sound spots. I am able to put away easy and medium difficulty overheads.",
        "rating" : "4.0",
        "endIfSelected" : false,
        "type" : "Net Play"
    },

    {
        "id" : 21,
        "text" : "When coming to the net after serving, I am consistently able to put the first volley in play; however, I am inconsistent when trying to volley powerful or angled returns. Close to the net, I can finish a point using various options including the drop volley, angle volley, punch volley.",
        "rating" : "4.5",
        "endIfSelected" : false,
        "type" : "Net Play"
    },
    
    {
        "id" : 22,
        "text" : "I am comfortable at the net in any situation and make sound tactical decisions. I can hit the overhead effectively from almost any position. I can follow up a first serve to the net and make volleys from ankle-to-knee height consistently.",
        "rating" : "5.0",
        "endIfSelected" : false,
        "type" : "Net Play"
    },

    {
        "id" : 23,
        "text" : "I have an incomplete service motion. My toss is inconsistent. Double faults are common for me unless serving underhand.",
        "rating" : "2.0",
        "endIfSelected" : false,
        "type" : "Serve"
    },

    {
        "id" : 24,
        "text" : "I am attempting a full service motion on the first serve. My frst serve in inconsistent (less than 50% success). I use an incomplete motion to ensure a steady second serve.",
        "rating" : "2.5",
        "endIfSelected" : false,
        "type" : "Serve"
    },

    {
        "id" : 25,
        "text" : "I use a full motion on both first and second serves. I am able to achieve more than 50% success on the first serve. My second serve is much slower than my first serve.",
        "rating" : "3.0",
        "endIfSelected" : false,
        "type" : "Serve"
    },

    {
        "id" : 26,
        "text" : "I can vary the speed or direction of my first serve. I can direct my second serve to the opponent's weakness without double-faulting on a regular basis.",
        "rating" : "3.5",
        "endIfSelected" : false,
        "type" : "Serve"
    },

    {
        "id" : 27,
        "text" : "I can vary the speed and direction of the first serve. I use spin (slice and kick) on my serves. Kick serves are still somewhat difficult to accomplish consistently.",
        "rating" : "4.0",
        "endIfSelected" : false,
        "type" : "Serve"
    },

    {
        "id" : 28,
        "text" : "I have an aggressive first serve with power and spin. My second serve frequently hits the court with good depth and placement. I can serve and volley after my first serves, but experience some inconsistency when the return is of a higher quality.",
        "rating" : "4.5",
        "endIfSelected" : false,
        "type" : "Serve"
    },

    {
        "id" : 29,
        "text" : "My first serve can win points outright or force a weak return consistently, or it is extremely consistent with medium pace and good placement. My second serve can prevent the opponent from attacking",
        "rating" : "5.0",
        "endIfSelected" : false,
        "type" : "Serve"
    },

    {
        "id" : 30,
        "text" : "I am capable of competing in Open level tournaments (5.0+).",
        "rating" : "5.0-5.5",
        "endIfSelected" : true,
        "type" : "general"
    },

    {
        "id" : 31,
        "text" : "I have extensive international level tournament experience at the entry professional level and above.",
        "rating" : "6.0+",
        "endIfSelected" : true,
        "type" : "general"
    },

    {
        "id" : 32,
        "text" : "None of the above.",
        "rating" : "",
        "endIfSelected" : false,
        "type" : "general"
    }

]