[
    {
        "id" : 0,
        "text" : "<b>I have never played tennis before.</b>",
        "rating" : "1.0-1.5",
        "endIfSelected" : true,
        "type" : "general"
    },

    {
        "id" : 1,
        "text" : "<b>I have been very briefly introduced to the game</b>, but I have difficulty playing the game due to a lack of consistency in rallying and serving.",
        "rating" : "1.5-2.0",
        "endIfSelected" : true,
        "type" : "general"
    }, 

    {
        "id" : 2,
        "text" : "I can get the ball in play but lack control, resulting in inconsistent rallies. I often chooses to hit forehands instead of backhands.",
        "rating" : "2.0",
        "endIfSelected" : false,
        "type" : "groundstrokes"
    }, 

    {
        "id" : 3,
        "text" : "I can rally 10 balls in a row, especially on the forehand, with an arched trajectory over the net when the objective is to hit to a partner at moderate speed.",
        "rating" : "2.5",
        "endIfSelected" : false,
        "type" : "groundstrokes"
    }, 

    {
        "id" : 4,
        "text" : "I am able to rally consistently 10 balls in a row on forehands and backhands. I am able to maintain a rally when receiving high, short, or wide balls, assuming the ball is received at a moderate pace, especially on the forehand side.",
        "rating" : "3.0",
        "endIfSelected" : false,
        "type" : "groundstrokes"
    },

    {
        "id" : 5,
        "text" : "I am able to move the opponent around the court or hit harder when receiving easier balls. I can execute approach shots with some consistency (more than 50% success rate). ",
        "rating" : "3.5",
        "endIfSelected" : false,
        "type" : "groundstrokes"
    },

    {
        "id" : 6,
        "text" : "I am able to develop points with some consistency by using a reliable combination of shots. I am erratic when attempting a quality shot, when receiving fast or wide balls, and when attempting passing shots.",
        "rating" : "4.0",
        "endIfSelected" : false,
        "type" : "groundstrokes"
    },

    {
        "id" : 7,
        "text" : "I can use a variety of spins. I am beginning to develop a dominant shot or good steadiness. I am erratic when attempting a quality shot in two of the following situations: receiving fast balls, wide balls, and in passing shot situations.",
        "rating" : "4.5",
        "endIfSelected" : false,
        "type" : "groundstrokes"
    },

    {
        "id" : 8,
        "text" : "I am able to maintain a consistent rally, 10 balls in a row on faster balls. I have very steady strokes or a dominant shot. I periodically succeed (50% success rate) when attempting a quality shot when receiving fast or wide balls, and in passing shot situations.",
        "rating" : "5.0",
        "endIfSelected" : false,
        "type" : "groundstrokes"
    },
    
    {
        "id" : 9,
        "text" : "<b>I have an inconsistent return.</b> I tend to position myself in a manner to protect weaknesses.",
        "rating" : "2.0",
        "endIfSelected" : false,
        "type" : "Return of Serve"
    },

    {
        "id" : 10,
        "text" : "In singles, I am consistent when returning towards the middle of the court. In doubles, I have difficulty returning crosscourt to start the point.",
        "rating" : "2.5",
        "endIfSelected" : false,
        "type" : "Return of Serve"
    },

    {
        "id" : 11,
        "text" : "I can control the direction of the ball in both singles and doubles, when receiving a serve of moderate pace.",
        "rating" : "3.0",
        "endIfSelected" : false,
        "type" : "Return of Serve"
    },

    {
        "id" : 12,
        "text" : "I can return fast serves or well-placed serves with defensive actions. When receiving an easy second serve, I can return with pace or directional control; I can approach the net in doubles after returning.",
        "rating" : "3.5",
        "endIfSelected" : false,
        "type" : "Return of Serve"
    },

    {
        "id" : 13,
        "text" : "I only have difficulty in returning spin serves when receiving very fast serves. On moderately paced serves, I can construct the point through hitting a good shot or exploiting an opponent's weakness. In doubles, I can vary returns effectively on moderately paced serves.",
        "rating" : "4.0",
        "endIfSelected" : false,
        "type" : "Return of Serve"
    },

    {
        "id" : 14,
        "text" : "Off first serves, I can defend consistently but very inconsistent (less then 30% success) when attempting an aggressive return. In doubles, I have difficulty (less than 50% success) when returning a first serve into the feet of the incoming serve and volleyer.",
        "rating" : "4.5",
        "endIfSelected" : false,
        "type" : "Return of Serve"
    },

    {
        "id" : 15,
        "text" : "I periodically succeed (50% success) at sending an aggressive return off fast first serves using my dominant shot (forehand or backhand). In doubles, I can return at the feet of serve and volleyer consistently.",
        "rating" : "5.0",
        "endIfSelected" : false,
        "type" : "Return of Serve"
    },

    {
        "id" : 16,
        "text" : "In singles, I am reluctant to come to the net. In doubles, I understand the basic positioning, but I am only comfortable only with the forehand volley; I avoid the backhand volley and overhead.",
        "rating" : "2.0",
        "endIfSelected" : false,
        "type" : "Net Play"
    },

    {
        "id" : 17,
        "text" : "I have become at ease at the net in practice but I am uncomfortable in a game situation",
        "rating" : "2.5",
        "endIfSelected" : false,
        "type" : "Net Play"
    },

    {
        "id" : 18,
        "text" : "I am very consistent on the forehand volley with easy balls, but I am inconsistent on the backhand volley. Overall, I have difficulty with low and wide balls. I can smash easy lobs.",
        "rating" : "3.0",
        "endIfSelected" : false,
        "type" : "Net Play"
    },

    {
        "id" : 19,
        "text" : "I have become confident at the net. I can direct forehand volleys; I can control the backhand volley but with little offense; I have general difficulty in putting volleys away. I can handle volleys and overheads that require moderate movement.",
        "rating" : "3.5",
        "endIfSelected" : false,
        "type" : "Net Play"
    },

    {
        "id" : 20,
        "text" : "In singles, I am comfortable with following an approach shot to the net. In doubles, I am comfortable receiving a variety of balls and converting to offensive positioning; I can poach on weak returns of serve. I am able to put away easy overheads.",
        "rating" : "4.0",
        "endIfSelected" : false,
        "type" : "Net Play"
    },

    {
        "id" : 21,
        "text" : "When coming to the net after serving, I am consistently able to put the first volley in play but without pace or depth; however, I am inconsistent when trying to volley powerful or angled returns. Close to the net, I can finish a point using various options including the drop volley, angle volley, punch volley.",
        "rating" : "4.5",
        "endIfSelected" : false,
        "type" : "Net Play"
    },
    
    {
        "id" : 22,
        "text" : "In singles, I am very comfortable at the net in any situation. In doubles, after the serve, I have a good, deep crosscourt volley. Overhead can be hit from almost any position.",
        "rating" : "5.0",
        "endIfSelected" : false,
        "type" : "Net Play"
    },

    {
        "id" : 23,
        "text" : "I have an incomplete service motion. My toss is inconsistent. Double faults are common for me unless serving underhand.",
        "rating" : "2.0",
        "endIfSelected" : false,
        "type" : "Serve"
    },

    {
        "id" : 24,
        "text" : "I am attempting a full service motion on the first serve. My frst serve in inconsistent (less than 50% success). I use an incomplete motion to ensure a steady second serve.",
        "rating" : "2.5",
        "endIfSelected" : false,
        "type" : "Serve"
    },

    {
        "id" : 25,
        "text" : "I use a full motion on both first and second serves. I am able to achieve more than 50% success on the first serve. My second serve is much slower than my first serve. ",
        "rating" : "3.0",
        "endIfSelected" : false,
        "type" : "Serve"
    },

    {
        "id" : 26,
        "text" : "I can vary the speed or direction of my first serve. I can direct my second serve to the opponent's weakness without double-faulting on a regular basis.",
        "rating" : "3.5",
        "endIfSelected" : false,
        "type" : "Serve"
    },

    {
        "id" : 27,
        "text" : "I can vary the speed and direction of the first serve. I use spin on my serves.",
        "rating" : "4.0",
        "endIfSelected" : false,
        "type" : "Serve"
    },

    {
        "id" : 28,
        "text" : "I have an aggressive first serve with power and spin. My second serve frequently hits the court with good depth and placement. I can serve and volley after my first serves in doubles, but experience some inconsistency.",
        "rating" : "4.5",
        "endIfSelected" : false,
        "type" : "Serve"
    },

    {
        "id" : 29,
        "text" : "My first serve can win points outright, or force a weak return. My second serve can prevent the opponent from attacking. I serve and volley off the first serve in doubles with consistency.",
        "rating" : "5.0",
        "endIfSelected" : false,
        "type" : "Serve"
    },

    {
        "id" : 30,
        "text" : "<b>I am capable of competing in 'open' category provincial level tournaments.</b> I have developed a gamestyle which is recognizable as either an all-court player, an aggressive baseliner, a serve and volleyer, or a retriever. I have developed good anticipation either technically (can read toss on serve, body position…) or tactically (can read opponents tendencies in specific situations). I have no major weaknesses and can counterattack effectively against a hard ball, wide ball, or in passing shot situations. I have the ability to use specific shots in order to exploit opponent’s weakness: drop-shot, lob, angle, moonball…",
        "rating" : "5.0-5.5",
        "endIfSelected" : true,
        "type" : "general"
    },

    {
        "id" : 31,
        "text" : "<b>I have extensive international 'open' level tournament experience at the entry professional level (challenger or satellite experience).</b> My rankings or past rankings will speak for themselves. I have had intensive training for national tournament competition at the junior level and collegiate levels and have obtained a provincial and/or national 'open' ranking.",
        "rating" : "6.0+",
        "endIfSelected" : true,
        "type" : "general"
    },

    {
        "id" : 32,
        "text" : "<b>None of the above.</b>",
        "rating" : "",
        "endIfSelected" : false,
        "type" : "general"
    }

]